# -*- coding: utf-8 -*-

TEXT_IF_ARTICLE_ALREADY_EXIST = '\nУпс, вы уже такое сохраняли :)'

TEXT_IF_ARTICLE_INCLUDE_IN_DB = '\nСохранил, спасибо!'

TEXT_IF_STORAGE_EMPTY = '\nВы пока не сохранили ни одной статьи :(\nЕсли нашли что-то стоящее, я жду!'

TEXT_WELCOME = '\nПривет, я бот, который поможет не забыть прочитать статьи, найденные тобой в интернете :)'

TEXT_HELP = ('\n- Чтобы я запомнил статью, достаточно передать мне ссылку на нее. '
             'К примеру https://example.com'
             '\n- Чтобы получить случайную статью, достаточно передать мне команду /get_article.'
             '\nНо помни! Отдавая статью тебе на прочтение, она больше не хранится в моей базе. '
             'Так что тебе точно нужно ее изучить')
